ОДУПР/src/Catalogs/оду_НастройкаКонвертацииДанных/оду_НастройкаКонвертацииДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>оду_НастройкаКонвертацииДанных</name>
  <attributes>
    <name>Используется</name>
    <comment>Вкл / выкл участника обмена</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимОтладки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонфигурацияКонвертацииОбмена</name>
    <type>
      <types>EnumRef.оду_КонфигурацияКонвертацииДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ИДКонфигурацииИсточника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИДКонфигурацииПриемника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПОД</name>
    <comment>Правило обмена данными (xml)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоВыгрузки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоЗагрузки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКОбработкиОтладки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОбработкуБСП</name>
    <comment>При отладке</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработкаОтладкиБСП</name>
    <type>
      <types>CatalogRef.ДополнительныеОтчетыИОбработки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПОДИзФайла</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПОДИзОбработкиБСП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКПОД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ОДУПР/src/Catalogs/оду_НастройкаКонвертацииДанных/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НастройкаФормы();
КонецПроцедуры

&НаСервере
Процедура НастройкаФормы()
	
	Элементы.ГруппаОтладки.Доступность = Объект.РежимОтладки;
	
	Элементы.ГруппаВыгрузка.Видимость = Объект.КонфигурацияКонвертацииОбмена = ПредопределенноеЗначение("Перечисление.оду_КонфигурацияКонвертацииДанных.Произвольная");
	
КонецПроцедуры
 

&НаКлиенте
Процедура ПутьКОбработкиОтладкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПолноеИмяФайла = пр_Клиент.ВыборКаталогаФайлаНачалоВыбора();
	Если ЗначениеЗаполнено(ПолноеИмяФайла)  Тогда
		Объект.ПутьКОбработкиОтладки = ПолноеИмяФайла; 
		Если НЕ ЗначениеЗаполнено(Объект.Код)  Тогда
		    Объект.Код = пр_Общий.ИмяФайлаПоПути(ПолноеИмяФайла);
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКПОДНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПолноеИмяФайла = пр_Клиент.ВыборКаталогаФайлаНачалоВыбора();
	Если ЗначениеЗаполнено(ПолноеИмяФайла)  Тогда
		Объект.ПутьКПОД = ПолноеИмяФайла; 
		Объект.ПОДИзФайла = Истина; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПОДИзОбработкиБСППриИзменении(Элемент)
	Объект.ПОДИзФайла = НЕ Объект.ПОДИзОбработкиБСП;
КонецПроцедуры

&НаКлиенте
Процедура ПОДИзФайлаПриИзменении(Элемент)
	Объект.ПОДИзОбработкиБСП = НЕ Объект.ПОДИзФайла;
КонецПроцедуры

&НаКлиенте
Процедура РежимОтладкиПриИзменении(Элемент)  
	Элементы.ГруппаОтладки.Доступность = Объект.РежимОтладки;
КонецПроцедуры

&НаКлиенте
Процедура КонфигурацияКонвертацииОбменаПриИзменении(Элемент)
	НастройкаФормы();
КонецПроцедуры
